# Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку. Тобто функція приймає два
# аргументи: список і величину зсуву (якщо ця величина додатна - пересуваємо з кінця на початок, якщо від'ємна -
# навпаки - пересуваємо елементи з початку списку в його кінець).
#    Наприклад:
#    fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
#    fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]

def fnc(lst, shift):
	shift = int(shift)
	new_lst = []
	for index in range(len(lst)):
		new_lst.append(lst[index - shift % len(lst)])
	return new_lst


print(fnc([1, 2, 3, 4, 5], 1))